""" 
Напишите функцию merge(), объединяющую словари в один общий. 
Функция должна принимать список словарей и возвращать словарь, 
каждый ключ которого содержит множество (тип данных set) уникальных значений собранных из всех словарей переданного списка.

Следующий программный код:

result = merge([{'a': 1, 'b': 2}, {'b': 10, 'c': 100}, {'a': 1, 'b': 17, 'c': 50}, {'a': 5, 'd': 777}])

создает словарь:

result = {'a': {1, 5}, 'b': {2, 10, 17}, 'c': {50, 100}, 'd': {777}}
"""

# Решение:


def merge(values):
    result = {}
    for i in values:
        for k, v in i.items():
            result.setdefault(k, set()).add(v)

    return result
